In [3]:
import pandas as pd 
import numpy as np

In [2]:
# rename index 方法
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
  index=['Ohio', 'Colorado', 'New York'],
  columns=['one', 'two', 'three', 'four'])

In [4]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [5]:
transfrom = lambda x: x[:4].upper()

In [6]:
data.index.map(transfrom)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [8]:
data.index = data.index.map(transfrom)

In [9]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [11]:
# index => row column => column
data.rename(index=str.title , columns = str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [13]:
# 改index col rename
#inplace 直接更改真實值
data.rename(index = {'OHIO':'INDIANA'},
                                        columns = {'three':'peekaoo'} , inplace=True

)

In [14]:
data

         one  two  peekaoo  four
INDIANA    0    1        2     3
COLO       4    5        6     7
NEW        8    9       10    11

In [17]:
# 以bin 作為基準計算類別型 是否在 18-25 , 25-35 , 35-60 , 60-100 區間內
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18,25,35,60,100]
cats = pd.cut(ages,bins)

In [18]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [19]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [24]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [25]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [26]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [27]:
pd.cut(ages,bins , labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [31]:
# 將data 區分成四塊 precision 為小數點後兩位
data = np.random.rand(20)
pd.cut(data,4,precision=2)

[(0.0744, 0.302], (0.302, 0.528], (0.528, 0.755], (0.528, 0.755], (0.0744, 0.302], ..., (0.755, 0.981], (0.302, 0.528], (0.302, 0.528], (0.0744, 0.302], (0.302, 0.528]]
Length: 20
Categories (4, interval[float64]): [(0.0744, 0.302] < (0.302, 0.528] < (0.528, 0.755] < (0.755, 0.981]]

In [35]:
data = np.random.randn(1000)
cats = pd.qcut(data,4,precision=2)

In [36]:
cats

[(0.59, 3.43], (-0.7, -0.041], (-0.041, 0.59], (-3.2899999999999996, -0.7], (-0.041, 0.59], ..., (-0.7, -0.041], (0.59, 3.43], (0.59, 3.43], (-3.2899999999999996, -0.7], (-0.7, -0.041]]
Length: 1000
Categories (4, interval[float64]): [(-3.2899999999999996, -0.7] < (-0.7, -0.041] < (-0.041, 0.59] < (0.59, 3.43]]

In [37]:
pd.value_counts(cats)

(0.59, 3.43]                   250
(-0.041, 0.59]                 250
(-0.7, -0.041]                 250
(-3.2899999999999996, -0.7]    250
dtype: int64

In [40]:
data = pd.DataFrame(np.random.randn(1000,4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.050502    -0.035873     0.016212    -0.038489
std       1.023281     1.025166     1.043223     0.979512
min      -3.113182    -3.108263    -3.158571    -3.637438
25%      -0.712792    -0.742503    -0.707112    -0.699285
50%      -0.079100    -0.012796     0.032267    -0.029976
75%       0.638679     0.675818     0.733422     0.654349
max       3.534146     3.752004     3.126396     2.847545

In [41]:
col = data[2]
col[np.abs(col) > 3]

6     -3.158571
497    3.126396
Name: 2, dtype: float64

In [42]:
data[(np.abs(data) >3).any(1) ]

            0         1         2         3
6    1.650434  1.220697 -3.158571 -1.244806
61   3.534146 -2.445409  0.472647 -0.428740
66  -0.158561 -3.108263 -2.734155  0.259326
113  0.015899  1.680946 -0.941767 -3.592664
130  0.656541  3.093080 -0.385501  0.390594
269  0.845477  3.752004  0.172557  0.961531
398 -3.113182  0.851846  0.411076 -1.481939
407  3.186197 -0.305669  0.808164  1.752151
425  0.000036 -1.235831 -1.213488 -3.637438
497  0.997595 -0.234457  3.126396  0.239990
501 -0.060253  3.129903 -0.833830  0.200040
634  3.172337 -0.635817  0.113307  0.401827
862  1.080671  1.311303  2.179721 -3.439719

In [43]:
data[np.abs(data)>3]  = np.sign(data) * 3

In [45]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.051282    -0.036740     0.016244    -0.036819
std       1.020108     1.021662     1.042382     0.973955
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.712792    -0.742503    -0.707112    -0.699285
50%      -0.079100    -0.012796     0.032267    -0.029976
75%       0.638679     0.675818     0.733422     0.654349
max       3.000000     3.000000     3.000000     2.847545

In [46]:
df = pd.DataFrame(np.arange(5 *4 ).reshape(5,4))

In [49]:
sampler = np.random.permutation(5)
sampler

array([0, 4, 2, 1, 3])

In [50]:
# take 可自己設 row
df.take(sampler)

    0   1   2   3
0   0   1   2   3
4  16  17  18  19
2   8   9  10  11
1   4   5   6   7
3  12  13  14  15

In [52]:
df.sample(n=3)

    0   1   2   3
2   8   9  10  11
4  16  17  18  19
0   0   1   2   3

In [55]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'], 'data1': range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [56]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [60]:
dummies = pd.get_dummies(df['key'],prefix='key')
df_with_dummy = df[['data1']].join(dummies)

In [61]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [62]:
 val = 'a,b,       guido'

In [63]:
val.split(',')

['a', 'b', '       guido']

In [64]:
pieces = [x.strip() for x in val.split(',')]

In [65]:
pieces

['a', 'b', 'guido']

In [66]:
first , second , third = pieces
first + '::' + second +'::' + third

'a::b::guido'

In [67]:
'::'.join(pieces)

'a::b::guido'

In [68]:
val.find(':')

-1

In [69]:
val.count(',')

2

In [70]:
import re

In [72]:
text = 'foo         bar\t bar     \tqux'
re.split('\s+' , text)

['foo', 'bar', 'bar', 'qux']

In [75]:
regex = re.compile('\s+')
regex.split(text)

['foo', 'bar', 'bar', 'qux']

In [76]:
regex.findall(text)

['         ', '\t ', '     \t']

In [77]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

In [81]:
regex = re.compile(pattern,flags=re.IGNORECASE)
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [82]:
print(regex.sub('REDACTED',text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [83]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com','Rob': 'rob@gmail.com', 'Wes': np.nan}

In [85]:
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [86]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [87]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [88]:
pattern

'[A-Z0-9._%+-]+@[A-Z0-9.-]+\\.[A-Z]{2,4}'

In [89]:
data.str.findall(pattern, flags= re.IGNORECASE)

Dave     [dave@google.com]
Steve    [steve@gmail.com]
Rob        [rob@gmail.com]
Wes                    NaN
dtype: object

In [90]:
matches = data.str.match(pattern, flags=re.IGNORECASE)

In [91]:
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [93]:
matches.str.get(1)

AttributeError: Can only use .str accessor with string values!

In [3]:
data = pd.Series(np.random.randn(9),
index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
[1, 2, 3, 1, 3, 1, 2, 2, 3]])
data

a  1    1.592820
   2   -0.301829
   3    1.384068
b  1   -1.501261
   3   -0.439054
c  1   -1.754418
   2    1.207252
d  2   -1.074313
   3   -0.128391
dtype: float64

In [4]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [5]:
data['b']

1   -1.501261
3   -0.439054
dtype: float64

In [6]:
data['b':'c']

b  1   -1.501261
   3   -0.439054
c  1   -1.754418
   2    1.207252
dtype: float64

In [7]:
data.loc[['b','a']]

b  1   -1.501261
   3   -0.439054
a  1    1.592820
   2   -0.301829
   3    1.384068
dtype: float64

In [8]:
# 抓出 acd index[2] 選項
data.loc[:, 2]

a   -0.301829
c    1.207252
d   -1.074313
dtype: float64

In [10]:
data.unstack()

          1         2         3
a  1.592820 -0.301829  1.384068
b -1.501261       NaN -0.439054
c -1.754418  1.207252       NaN
d       NaN -1.074313 -0.128391

In [12]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
columns=[['Ohio', 'Ohio', 'Colorado'],
['Green', 'Red', 'Green']])

In [13]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [20]:
frame.index.names = ['key1','key2']

In [21]:
frame.columns.names = ['state','color']

In [22]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [23]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [24]:
frame['Colorado']

color      Green
key1 key2
a    1         2
     2         5
b    1         8
     2        11

In [26]:
frame.swaplevel('key1','key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [27]:
frame.sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [28]:
frame.swaplevel(0,1).sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [29]:
frame = pd.DataFrame({'a': range(7), 'b': range(7, 0, -1),
'c': ['one', 'one', 'one', 'two', 'two',
'two', 'two'],
'd': [0, 1, 2, 0, 1, 2, 3]})

In [30]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [35]:
frame2 = frame.set_index(['c','d'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [36]:
# dataframe不刪除內部
frame.set_index(['c','d'] , drop= False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [37]:
# reset set 相反參數
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

In [6]:
df1 = pd.DataFrame({
    'key':['b','b','a','c','a','a','b'],
    'data1':range(7)
})
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [40]:
df2 = pd.DataFrame({
    'key':['a','b','d'],
    'data2':range(3)
})

In [41]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [7]:
pd.merge(df1,df2,on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [8]:
df3 = pd.DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
'data1': range(7)})
df3

  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6

In [10]:
df4 = pd.DataFrame({'rkey': ['a', 'b', 'd'],
'data2': range(3)})
df4

  rkey  data2
0    a      0
1    b      1
2    d      2

In [11]:
pd.merge(df3,df4, left_on='lkey',right_on='rkey')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

In [12]:
pd.merge(df1,df2,how = 'outer')

  key  data1  data2
0   b    0.0    1.0
1   b    1.0    1.0
2   b    6.0    1.0
3   a    2.0    0.0
4   a    4.0    0.0
5   a    5.0    0.0
6   c    3.0    NaN
7   d    NaN    2.0

In [13]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
'data1': range(6)})
df2 = pd.DataFrame({'key': ['a', 'b', 'a', 'b', 'd'],
'data2': range(5)})

In [14]:
pd.merge(df1, df2, on='key', how='left')

   key  data1  data2
0    b      0    1.0
1    b      0    3.0
2    b      1    1.0
3    b      1    3.0
4    a      2    0.0
5    a      2    2.0
6    c      3    NaN
7    a      4    0.0
8    a      4    2.0
9    b      5    1.0
10   b      5    3.0

In [15]:
left = pd.DataFrame({'key1': ['foo', 'foo', 'bar'],
'key2': ['one', 'two', 'one'],
'lval': [1, 2, 3]})
left

  key1 key2  lval
0  foo  one     1
1  foo  two     2
2  bar  one     3

In [16]:
right = pd.DataFrame({'key1': ['foo', 'foo', 'bar', 'bar'],
'key2': ['one', 'one', 'one', 'two'],
'rval': [4, 5, 6, 7]})
right

  key1 key2  rval
0  foo  one     4
1  foo  one     5
2  bar  one     6
3  bar  two     7

In [19]:
pd.merge(left,right, on = 'key1')

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [20]:
pd.merge(left,right,on=['key1','key2'],how = 'inner')

  key1 key2  lval  rval
0  foo  one     1     4
1  foo  one     1     5
2  bar  one     3     6

In [21]:
pd.merge(left, right, on='key1', suffixes=('_left', '_right'))

  key1 key2_left  lval key2_right  rval
0  foo       one     1        one     4
1  foo       one     1        one     5
2  foo       two     2        one     4
3  foo       two     2        one     5
4  bar       one     3        one     6
5  bar       one     3        two     7

In [23]:
left1 = pd.DataFrame({'key': ['a', 'b', 'a', 'a', 'b', 'c'],
'value': range(6)})
right1 = pd.DataFrame({'group_val': [3.5, 7]}, index=['a', 'b'])
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [24]:
right1

   group_val
a        3.5
b        7.0

In [25]:
# 以左a merge 右邊 merge a完 在跑B
pd.merge(left1,right1,left_on='key',right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [26]:
pd.merge(left1,right1,left_on='key',right_index=True,how = 'outer')

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

In [2]:
lefth = pd.DataFrame({'key1': ['Ohio', 'Ohio', 'Ohio',
'Nevada', 'Nevada'],
'key2': [2000, 2001, 2002, 2001, 2002],
'data': np.arange(5.)})
lefth

     key1  key2  data
0    Ohio  2000   0.0
1    Ohio  2001   1.0
2    Ohio  2002   2.0
3  Nevada  2001   3.0
4  Nevada  2002   4.0

In [3]:
righth = pd.DataFrame(np.arange(12).reshape((6, 2)),
index=[['Nevada', 'Nevada', 'Ohio', 'Ohio',
'Ohio', 'Ohio'],
[2001, 2000, 2000, 2000, 2001, 2002]],
columns=['event1', 'event2'])
righth

             event1  event2
Nevada 2001       0       1
       2000       2       3
Ohio   2000       4       5
       2000       6       7
       2001       8       9
       2002      10      11

In [4]:
pd.merge(lefth,righth,left_on=['key1','key2'],right_index=True)

     key1  key2  data  event1  event2
0    Ohio  2000   0.0       4       5
0    Ohio  2000   0.0       6       7
1    Ohio  2001   1.0       8       9
2    Ohio  2002   2.0      10      11
3  Nevada  2001   3.0       0       1

In [5]:
pd.merge(lefth,righth,left_on=['key1','key2'],right_index=True,how = 'outer')

     key1  key2  data  event1  event2
0    Ohio  2000   0.0     4.0     5.0
0    Ohio  2000   0.0     6.0     7.0
1    Ohio  2001   1.0     8.0     9.0
2    Ohio  2002   2.0    10.0    11.0
3  Nevada  2001   3.0     0.0     1.0
4  Nevada  2002   4.0     NaN     NaN
4  Nevada  2000   NaN     2.0     3.0

In [7]:
left2 = pd.DataFrame([[1., 2.], [3., 4.], [5., 6.]],
....:
index=['a', 'c', 'e'],
....:
columns=['Ohio', 'Nevada'])
left2

   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

In [8]:
right2 = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [13, 14]],
....:
index=['b', 'c', 'd', 'e'],
....:
columns=['Missouri', 'Alabama'])
right2

   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

In [10]:
# join 利用index 來做merge
pd.merge(left2,right2,how ='outer',left_index=True,right_index=True)

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [12]:
right2.join(left2,how = 'outer')

   Missouri  Alabama  Ohio  Nevada
a       NaN      NaN   1.0     2.0
b       7.0      8.0   NaN     NaN
c       9.0     10.0   3.0     4.0
d      11.0     12.0   NaN     NaN
e      13.0     14.0   5.0     6.0